{
  "2026-02-25": {
    "answer": "Ante Sundaraniki",
    "hints": [
      "This 2022 Rom-Com movie revolves around religious boundaries.",
      "Hero works in an ad agency and Heroine is a professional photographer.",
      "They come from strict, orthodox families of different religions.",
      "They tell 2 different lies to convince their own families.",
      "Heroine dreams of having her wedding on Amelia Island."
    ],
    "details": {
      "Director": "Vivek Athreya",
      "Music": "Vivek Sagar",
      "Release Date": "10 June 2022",
      "IMDB": "7.6/10",
      "Trivia": "This film grossed over $1 million in the U.S, making it Nani's 7th film to do so."
    }
  },
  "2026-02-27": {
    "answer": "Kshanam",
    "hints": [
      "This 2016 thriller revolves around a mysterious kidnapping.",
      "Hero is an NRI who returns to India after a call from his ex.",
      "She asks his help to find her missing daughter.",
      "Everyone insists the girl doesn’t even exist.",
      "He later learns the girl is actually his own daughter."
    ],
    "details": {
      "Director": "Ravikanth Perepu",
      "Music": "Sricharan Pakala",
      "Release Date": "26 February 2016",
      "IMDB": "8.2/10",
      "Trivia": "This film was officially remade in multiple languages, most notably in Hindi as Baaghi 2."
    }
  },
  "2026-02-28": {
    "answer": "Mathu Vadalara",
    "hints": [
      "This 2019 dark comedy-thriller revolves around three close friends.",
      "The hero is a delivery boy struggling with money problems.",
      "He tries to steal money from an old lady during a delivery.",
      "He unexpectedly finds ₹10 lakhs in his delivery bags.",
      "He gets stuck in a murder and drug case inside an apartment."
    ],
    "details": {
      "Director": "Ritesh Rana",
      "Music": "Kaala Bhairava",
      "Release Date": "26 December 2019",
      "IMDB": "8.2/10",
      "Trivia": "The production used an actual retired police constable as a body double for Banerjee’s scenes to perfect the gait and mannerisms of a real cop."
    }
  },
  "2026-03-01": {
    "answer": "Orange",
    "hints": [
      "This 2010 romantic drama is about a hero who doesn’t believe in forever love.",
      "He lives in Australia and he is a graffiti artist.",
      "He falls for a girl who wants a lifelong relationship.",
      "He shares his past love story with a police officer.",
      "In the end, he realizes that sacrifice is a part of true love."
    ],
    "details": {
      "Director": "Bommarillu Bhaskar",
      "Music": "Harris Jayaraj",
      "Release Date": "26 November 2010",
      "IMDB": "6.5/10",
      "Trivia": "The film is the largest Indian budget film that was mostly shot in Australia. Over two hundred and fifty people from Australia were part of the cast and crew."
    }
  },
  "2026-03-02": {
    "answer": "Khaleja",
    "hints": [
      "This 2010 action drama that revolves around a mysterious illness spreading in a village.",
      "Hero is a taxi driver who ends up in Rajasthan for an unexpected task.",
      "Locals believe he’s a godsent savior who will protect them.",
      "He finds out someone is secretly behind the sickness.",
      "In the end, he fights back to save the villagers and fulfill their belief."
    ],
    "details": {
      "Director": "Trivikram Srinivas",
      "Music": "Manisharma",
      "Release Date": "7 October 2010",
      "IMDB": "7.6/10",
      "Trivia": "Khaleja’s climax fight scene was shot in a single take using a steadicam that lasted over 4 minutes without a cut."
    }
  },
  "2026-03-03": {
    "answer": "Sreekaram",
    "hints": [
      "This 2021 drama revolves around farming.",
      "Hero is a software engineer working in Hyderabad.",
      "He quits his job to return to his village and take up farming.",
      "He faces resistance from his father and other villagers.",
      "He inspires youth to value agriculture and rebuild rural life."
    ],
    "details": {
      "Director": "Kishore B.",
      "Music": "Mickey J. Meyer",
      "Release Date": "11 March 2021",
      "IMDB": "7.1/10",
      "Trivia": "To stay authentic, Sharwanand actually learned farming methods before shooting the film."
    }
  },
  "2026-03-04": {
    "answer": "Bheeshma",
    "hints": [
      "This 2020 rom-com revolves around organic farming.",
      "Hero is a single meme creator with no real goals in life.",
      "He falls for a girl who works at an organic farming company.",
      "Due to unexpected events, he becomes the CEO for 30 days.",
      "He must prove himself while exposing a dangerous chemical scam."
    ],
    "details": {
      "Director": "Venky Kudumula",
      "Music": "Mahati Swara Sagar",
      "Release Date": "21 February 2020",
      "IMDB": "6.6/10",
      "Trivia": "The name 'Bheeshma' appears over 150 times in the movie."
    }
  },
  "2026-03-05": {
    "answer": "1 Nenokkadine",
    "hints": [
      "This 2014 thriller is about a man searching for answers about his childhood.",
      "Hero is a rockstar.",
      "Heroine is a news reporter tries to help him.",
      "He believes someone killed his parents, but no one remembers them.",
      "He goes on a journey to find the truth about his past and who the killers are."
    ],
    "details": {
      "Director": "Sukumar",
      "Music": "Devi Sri Prasad",
      "Release Date": "10 January 2014",
      "IMDB": "8.0/10",
      "Trivia": "The editor used reverse cuts in key scenes to make the audience feel the same confusion as the hero."
    }
  },
  "2026-03-06": {
    "answer": "Yeto Vellipoyindhi Manasu",
    "hints": [
      "This 2012 love story shows the same couple in school, college, and as adults.",
      "They keep falling in love and also fighting a lot.",
      "The hero is a software guy. The heroine becomes a teacher.",
      "It’s all about misunderstandings and second chances.",
      "Nani is the protagonist, and Ilaiyaraaja is the music director."
    ],
    "details": {
      "Director": "Gautham Vasudev Menon",
      "Music": "Ilaiyaraaja",
      "Release Date": "14 December 2012",
      "IMDB": "7.3/10",
      "Trivia": "The film was simultaneously shot in Telugu and Tamil, and a Hindi version was started but later shelved."
    }
  },
  "2026-03-07": {
    "answer": "Kalki 2898 AD",
    "hints": [
      "This 2024 movie is set in the far future which revolves around a big city that controls everything.",
      "Hero lives in the slums and takes risky jobs to chase a better life.",
      "A gang tries to kill a pregnant woman for mysterious reasons.",
      "Someone risks his life to protect her.",
      "This movie is a mix of future and Indian history."
    ],
    "details": {
      "Director": "Nag Ashwin",
      "Music": "Santhosh Narayanan",
      "Release Date": "27 June 2024",
      "IMDB": "8.1/10",
      "Trivia": "Kalki 2898 AD became the first Indian film shot with the Arri Alexa 65 camera."
    }
  },
  "2026-03-08": {
    "answer": "Goodachari",
    "hints": [
      "This 2018 movie is about a young man who becomes a spy.",
      "Hero wants to serve the country like his father.",
      "He joins a secret agency and trains hard.",
      "Bad people attack and blame him for it.",
      "He runs and finds out who is behind everything."
    ],
    "details": {
      "Director": "Sashi Kiran Tikka",
      "Music": "Sricharan Pakala",
      "Release Date": "3 August 2018",
      "IMDB": "7.9/10",
      "Trivia": "Goodachari was shot in 168 locations across 4 countries on a limited budget."
    }
  },
  "2026-03-09": {
    "answer": "Srimanthudu",
    "hints": [
      "This 2015 movie is about a rich man who wants to help a poor village.",
      "Hero is the son of a big businessman.",
      "He visits a village and sees people suffering.",
      "He stays there to improve their lives.",
      "He fights local criminals who are harming the village."
    ],
    "details": {
      "Director": "Koratala Siva",
      "Music": "Devi Sri Prasad",
      "Release Date": "7 August 2015",
      "IMDB": "7.5/10",
      "Trivia": "After this movie, Mahesh Babu adopted two villages in real life."
    }
  },
  "2026-03-10": {
    "answer": "Devadas",
    "hints": [
      "This 2018 movie is about a gangster and a doctor becoming friends.",
      "Hero 1 is a don who hides from enemies.",
      "Hero 2 is a kind-hearted doctor who meets him by accident.",
      "They slowly become close and help each other.",
      "Together, they deal with both crime and emotional struggles."
    ],
    "details": {
      "Director": "Sriram Adittya",
      "Music": "Mani Sharma",
      "Release Date": "27 September 2018",
      "IMDB": "6.6/10",
      "Trivia": "Real guns and blank rounds were used for action scenes instead of VFX."
    }
  },
  "2026-03-11": {
    "answer": "Brochevarevarura",
    "hints": [
      "This 2019 crime comedy is about three college boys who always fail exams.",
      "They meet a girl who is controlled by her strict father.",
      "They try to help her escape, but their plan goes wrong.",
      "They get caught in a kidnapping mess they didn’t plan.",
      "At the same time, another story about a film director connects with them."
    ],
    "details": {
      "Director": "Vivek Athreya",
      "Music": "Vivek Sagar",
      "Release Date": "28 June 2019",
      "IMDB": "8.0/10",
      "Trivia": "The film uses parallel storytelling with two different timelines that meet in the end."
    }
  }
}
